C**********************************************************************
C 1.2　漸化式
C**********************************************************************
      implicit none
      integer :: n,NN
      real :: x,xx,gosa,EPS

      NN=100 !最大でNN回繰り返す
      EPS=1.0E-6 !相対誤差がこれより小さくなったら収束したとする
  901 format(a,I3,a5,f8.6) !結果の出力の準備

C**********************************************************************
C 1つめの漸化式の場合
C**********************************************************************
      x=1.0 !x=1.0から始める
      write(*,*) "Recurrence formula 1: "

      do n=1,NN
        xx=1.0+1.0/x  !計算結果（n+1）をxxに格納する

C       結果の出力
        write(*,901) "n:", n, "   x: ", xx

C       収束判定
        gosa=abs(xx-x)/abs(x)
        if(gosa.lt.EPS) then
          write(*,*) "Converged!"
          write(*,*) " "
          exit !ループから抜ける
        end if

C       計算した値をxにコピー（次の時間の準備）
        x=xx
      end do

C**********************************************************************
C 2つめの漸化式の場合
C**********************************************************************
      x=1.0 !x=1.0から始める
      write(*,*) "Recurrence formula 2: "

      do n=1,NN
        xx=sqrt(x+1.0)
        write(*,901) "n:", n, " x: ", xx
        gosa=abs(xx-x)/abs(x)
        if(gosa.lt.EPS) then
          write(*,*) "Converged!"
          write(*,*) " "
          exit
        end if
        x=xx
      end do

C**********************************************************************
C 3つめの漸化式の場合
C**********************************************************************
      x=1.0 !x=1.0から始める
      write(*,*) "Recurrence formula 3: "

      do n=1,NN
        xx=(x**2+1.0)/(2.0*x-1.0)
        write(*,901) "n:", n, " x: ", xx
        gosa=abs(xx-x)/abs(x)
        if(gosa.lt.EPS) then
          write(*,*) "Converged!"
          exit
        end if
        x=xx
      end do

      end
