C**********************************************************************
C 10.2　シンプソンの公式
C**********************************************************************
      implicit none
      integer :: n,j
      real :: a,b,f,h,S1,S2,S

C アルゴリズム手順１．
      n=10
      a=0.0
      b=2.0*atan(1.0) !π/2

C アルゴリズム手順２．
      h=(b-a)/(2.0*real(n))
      S1=0.0
      S2=f(a+h)

C アルゴリズム手順３．
      do j=2,2*n-2,2
        S1=S1+f(a+j*h)
        S2=S2+f(a+(j+1)*h)
      end do

C アルゴリズム手順４．
      S=(f(a)+2.0*S1+4.0*S2+f(b))*h/3.0

C 結果の出力
      write(*,901) "S(Simpson's rule) =        ", S

  901 format(A30,f10.6)
      end

C**********************************************************************
C 関数fの定義
C**********************************************************************
      real function f(x)
      implicit none
      real :: x

      f=sin(x)
      end function
