C**********************************************************************
C 10.3　端点の値を補正した台形公式
C**********************************************************************
      implicit none
      integer :: n,j
      real :: a,b,f,f2,h,S

      n=10
      a=0.0
      b=2.0*atan(1.0) !π/2

      h=(b-a)/real(n)
      S=0.0

C 式(10.14)第1項
      do j=1,n-1
        S=S+f(a+j*h)
      end do
      S=(f(a)+2.0*S+f(b))*h/2.0

C 式(10.14)第2項
      S=S+(f2(a)-f2(b))*h**2/12.0

C 結果の出力
      write(*,901) "S(Hermite interpolation) = ", S

  901 format(A30,f10.6)
      end

C**********************************************************************
C 関数fの定義
C**********************************************************************
      real function f(x)
      implicit none
      real :: x

      f=sin(x)
      end function
C**********************************************************************
C fの導関数の定義
C**********************************************************************
      real function f2(x)
      implicit none
      real :: x

      f2=cos(x)
      end function
